---
kind: property
id: P:Autodesk.Revit.DB.PointCloudType.EngineIdentifier
source: html/4cb3c05e-4a87-ffe3-fcb2-fba451dd8004.htm
---
# Autodesk.Revit.DB.PointCloudType.EngineIdentifier Property

The identifier of the engine responsible for handling of the point cloud.

## Syntax (C#)
```csharp
public string EngineIdentifier { get; }
```

## Remarks
The built-in engine provides "rcs" and "rcp" here.